configuration/src/Tasks/PerformerTask/PerformerTask.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>PerformerTask</name>
  <addressing>InformationRegister.TaskPerformers</addressing>
  <attributes>
    <name>Author</name>
    <comment>Author of the business process that generated the issue</comment>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Importance</name>
    <comment>To order the performer's tasks by priority</comment>
    <type>
      <types>EnumRef.TaskImportanceOptions</types>
    </type>
  </attributes>
  <attributes>
    <name>TaskPerformersGroup</name>
    <type>
      <types>CatalogRef.TaskPerformersGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>CompletionDate</name>
    <comment>Date and time when the task was actually completed</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>StartDate</name>
    <comment>For the performer to organize their tasks</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>AcceptForExecutionDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LongDesc</name>
    <comment>Description of the task statement for the performer</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SubjectOf</name>
    <comment>The subject task</comment>
    <type>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>SubjectString</name>
    <comment>String representation of the item</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AcceptedForExecution</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExecutionResult</name>
    <comment>Description of the execution result</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessProcessState</name>
    <type>
      <types>EnumRef.BusinessProcessStates</types>
    </type>
  </attributes>
  <attributes>
    <name>TaskDueDate</name>
    <comment>Planned deadline for completing the task</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>AuthorAsString</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <addressingAttributes>
    <name>AdditionalAddressingObject</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Performer</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>MainAddressingObject</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>PerformerRole</name>
    <type>
      <types>CatalogRef.PerformerRoles</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

configuration/src/Tasks/PerformerTask/Forms/ForwardTasks/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region EventHandlersForm

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	FormTitleText = Parameters.FormCaption;
	DefaultTitle = IsBlankString(FormTitleText);
	If Not DefaultTitle Then
		Title = FormTitleText;
	EndIf;
	
	TitleText = "";
	
	If Parameters.TaskCount > 1 Then
		TitleText = StringFunctionsClientServer.SubstituteParametersToString(NStr("en = '%1 (%2)';"),
			?(DefaultTitle, NStr("en = 'Selected tasks';"), FormTitleText),
			String(Parameters.TaskCount));
	ElsIf Parameters.TaskCount = 1 Then
		TitleText = StringFunctionsClientServer.SubstituteParametersToString(NStr("en = '%1 %2';"),
			?(DefaultTitle, NStr("en = 'Selected task';"), FormTitleText),
			String(Parameters.Task));
	Else
		Items.TitleDecoration.Visible = False;
	EndIf;
	Items.TitleDecoration.Title = TitleText;
	
	SetAddressingObjectTypes();
	SetItemsState();
	
EndProcedure

&AtServer
Procedure FillCheckProcessingAtServer(Cancel, CheckedAttributes)
	
	If AddressingType = 0 Then
		If Not ValueIsFilled(Performer) Then
			Common.MessageToUser(
				NStr("en = 'The task assignee is not specified.';"),,,
				"Performer",
				Cancel);
		EndIf;
		Return;
	EndIf;
	
	If Role.IsEmpty() Then
		Common.MessageToUser(
			NStr("en = 'The task assignee role is not specified.';"),,,
			"Role",
			Cancel);
		Return;
	EndIf;
	
	MainAddressingObjectTypesAreSet = UsedByAddressingObjects
		And ValueIsFilled(MainAddressingObjectTypes);
	TypesOfAditionalAddressingObjectAreSet = UsedByAddressingObjects 
		And ValueIsFilled(AdditionalAddressingObjectTypes);
	
	If MainAddressingObjectTypesAreSet And MainAddressingObject = Undefined Then
		Common.MessageToUser(
			StringFunctionsClientServer.SubstituteParametersToString(NStr("en = 'The ""%1"" field is required.';"),	Role.MainAddressingObjectTypes.Description),,,
			"MainAddressingObject",
			Cancel);
		Return;
	ElsIf TypesOfAditionalAddressingObjectAreSet And AdditionalAddressingObject = Undefined Then
		Common.MessageToUser(
			StringFunctionsClientServer.SubstituteParametersToString(NStr("en = 'The ""%1"" field is required.';"), Role.AdditionalAddressingObjectTypes.Description),,,
			"AdditionalAddressingObject",
			Cancel);
		Return;
	EndIf;
	
	If Not IgnoreWarnings 
		And Not BusinessProcessesAndTasksServer.HasRolePerformers(Role, MainAddressingObject, AdditionalAddressingObject) Then
		Common.MessageToUser(
			NStr("en = 'No assignee is assigned to the specified role. (To ignore this warning, select the check box).';"),,,
			"Role",
			Cancel);
		Items.IgnoreWarnings.Visible = True;
	EndIf;	
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure PerformerOnChange(Item)
	
	AddressingType = 0;
	MainAddressingObject = Undefined;
	AdditionalAddressingObject = Undefined;
	SetAddressingObjectTypes();
	SetItemsState();
	
EndProcedure

&AtClient
Procedure RoleOnChange(Item)
	
	AddressingType = 1;
	Performer = Undefined;
	MainAddressingObject = Undefined;
	AdditionalAddressingObject = Undefined;
	SetAddressingObjectTypes();
	SetItemsState();
	
EndProcedure

&AtClient
Procedure AddressingTypeOnChange(Item)
	SetItemsState();
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure Forward(Command)
	
	ClearMessages();
	If Not CheckFilling() Then
		Return;
	EndIf;
	Close(ClosingParameters());
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure SetAddressingObjectTypes()
	
	MainAddressingObjectTypes = Role.MainAddressingObjectTypes.ValueType;
	AdditionalAddressingObjectTypes = Role.AdditionalAddressingObjectTypes.ValueType;
	UsedByAddressingObjects = Role.UsedByAddressingObjects;
	UsedWithoutAddressingObjects = Role.UsedWithoutAddressingObjects;
	
EndProcedure

&AtServer
Procedure SetItemsState()
	
	Items.Performer.MarkIncomplete = False;
	Items.Performer.AutoMarkIncomplete = AddressingType = 0;
	Items.Performer.Enabled = AddressingType = 0;
	Items.Role.MarkIncomplete = False;
	Items.Role.AutoMarkIncomplete = AddressingType <> 0;
	Items.Role.Enabled = AddressingType <> 0;
	
	MainAddressingObjectTypesAreSet = UsedByAddressingObjects
		And ValueIsFilled(MainAddressingObjectTypes);
	TypesOfAditionalAddressingObjectAreSet = UsedByAddressingObjects 
		And ValueIsFilled(AdditionalAddressingObjectTypes);
		
	Items.MainAddressingObject.Title = Role.MainAddressingObjectTypes.Description;
	Items.OneMainAddressingObject.Title = Role.MainAddressingObjectTypes.Description;
	
	If MainAddressingObjectTypesAreSet And TypesOfAditionalAddressingObjectAreSet Then
		Items.OneAddressingObjectGroup.Visible = False;
		Items.TwoAddressingObjectsGroup.Visible = True;
	ElsIf MainAddressingObjectTypesAreSet Then
		Items.OneAddressingObjectGroup.Visible = True;
		Items.TwoAddressingObjectsGroup.Visible = False;
	Else	
		Items.OneAddressingObjectGroup.Visible = False;
		Items.TwoAddressingObjectsGroup.Visible = False;
	EndIf;
		
	Items.AdditionalAddressingObject.Title = Role.AdditionalAddressingObjectTypes.Description;
	
	Items.MainAddressingObject.AutoMarkIncomplete = MainAddressingObjectTypesAreSet
		And Not UsedWithoutAddressingObjects;
	Items.OneMainAddressingObject.AutoMarkIncomplete = MainAddressingObjectTypesAreSet
		And Not UsedWithoutAddressingObjects;
	Items.AdditionalAddressingObject.AutoMarkIncomplete = TypesOfAditionalAddressingObjectAreSet
		And Not UsedWithoutAddressingObjects;
	Items.OneMainAddressingObject.TypeRestriction = MainAddressingObjectTypes;
	Items.MainAddressingObject.TypeRestriction = MainAddressingObjectTypes;
	Items.AdditionalAddressingObject.TypeRestriction = AdditionalAddressingObjectTypes;
	
EndProcedure

&AtClient
Function ClosingParameters()
	
	Result = New Structure;
	Result.Insert("Performer", ?(ValueIsFilled(Performer), Performer, Undefined));
	Result.Insert("PerformerRole", Role);
	Result.Insert("MainAddressingObject", MainAddressingObject);
	Result.Insert("AdditionalAddressingObject", AdditionalAddressingObject);
	Result.Insert("Comment", Comment);
	
	If Result.MainAddressingObject <> Undefined And Result.MainAddressingObject.IsEmpty() Then
		Result.MainAddressingObject = Undefined;
	EndIf;
	
	If Result.AdditionalAddressingObject <> Undefined And Result.AdditionalAddressingObject.IsEmpty() Then
		Result.AdditionalAddressingObject = Undefined;
	EndIf;
	
	Return Result;
	
EndFunction

#EndRegion
